<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
    <title>selene-craft</title>
    <link href="https://selenevn.github.io/feed.xml" rel="self" />
    <link href="https://selenevn.github.io" />
    <updated>2017-08-23T15:46:08+07:00</updated>
    <author>
        <name>selene</name>
    </author>
    <id>https://selenevn.github.io</id>

    <entry>
        <title>Đưa bài lên web thế nào?</title>
        <author>
            <name>selene</name>
        </author>
        <link href="https://selenevn.github.io/dua-bai-len-web-the-nao.html"/>
        <id>https://selenevn.github.io/dua-bai-len-web-the-nao.html</id>
            <category term="web"/>
            <category term="idea"/>

        <updated>2017-08-23T15:45:59+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="https://selenevn.github.io/media/posts/5/istock_000015286795medium.jpg" alt="" />
                <p>Trang web vẫn chưa ho&agrave;n thiện. Tao tạm d&ugrave;ng github để l&agrave;m c&aacute;i blog ghi ch&eacute;p lại những &yacute; tưởng vặt v&atilde;nh nảy sinh trong qu&aacute; tr&igrave;nh ho&agrave;n thiện.</p>
<p>Với &yacute; tưởng l&agrave;m trang web giới thiệu c&aacute;c mặt h&agrave;ng handmade (chủ yếu l&agrave; đồ da), th&igrave; việc lập v&agrave; vận h&agrave;nh&nbsp;một trang web l&agrave; việc thừa th&atilde;i. Tao kh&ocirc;ng c&oacute; nhiều th&ocirc;ng tin để post l&ecirc;n thường xuy&ecirc;n, v&agrave; cũng kh&ocirc;ng muốn mất nhiều th&igrave; giờ để học quản l&yacute; trang web. &Yacute; tưởng của tao l&agrave; chỉ mua t&ecirc;n miền rồi gắn c&aacute;i t&ecirc;n miền ấy v&agrave;o một repo tr&ecirc;n github.</p>
<p>Chỉ l&agrave; một trang web tĩnh, đơn giản vậy th&ocirc;i.</p>
<p>Đ&acirc;y l&agrave; c&aacute;c bước để update th&ocirc;ng tin</p>
<ol>
<li>Clone repo đ&atilde; lập cho trang web (<a href="https://github.com/selenevn/selenevn.github.io">https://github.com/selenevn/selenevn.github.io</a>) lưu tại <code>D:/www/selenevn.github.io/</code>.</li>
<li>D&ugrave;ng wamp tạo virtualhost cho thư mục tr&ecirc;n, với t&ecirc;n miền <strong>selene.dev</strong> (chỉ sử dụng ở m&aacute;y t&iacute;nh).</li>
<li>D&ugrave;ng publii (<a href="https://getpublii.com/">https://getpublii.com/</a>) để l&agrave;m trang web tĩnh. Th&ocirc;ng tin sau khi update c&oacute; thể kiểm tra th&ocirc;ng qua preview của phần mềm hoặc copy to&agrave;n bộ c&aacute;c file sinh ra trong thư mục output sang virtualhost để xem tr&ecirc;n tr&igrave;nh duyệt.</li>
<li>Khi ok to&agrave;n bộ rồi th&igrave; chỉ cần commit v&agrave; push l&ecirc;n github (từ virtualhost) l&agrave; xong.</li>
</ol>
<hr>
<h2>update</h2>
<p>Thực tế l&agrave; quy tr&igrave;nh tr&ecirc;n vẫn c&oacute; vẻ kh&ocirc;ng ổn lắm. Thứ nhất l&agrave; vẫn phải qua nhiều bước. Thứ hai l&agrave; kh&ocirc;ng tận dụng được t&iacute;nh năng versioning đặc sản của Git.</p>
<p>Mỗi lần copy từ thư mục output (hoặc unzip) l&agrave; to&agrave;n bộ&nbsp;file/folder đều được thay thế chứ kh&ocirc;ng phải chỉ update ri&ecirc;ng những phần c&oacute; thay đổi. Chỉ text file th&ocirc;i th&igrave; c&ograve;n c&oacute; thể chấp nhận, đằng n&agrave;y trang web của tao lại d&ugrave;ng kh&aacute; nhiều h&igrave;nh ảnh.</p>
<p>Một vấn đề kh&aacute;c, l&agrave; khi sử dụng tại localhost, th&igrave; tao phải thay bằng t&ecirc;n miền d&ugrave;ng tại localhost th&igrave; trang web mới hoạt động b&igrave;nh thường.</p>
<p>T&oacute;m lại quy tr&igrave;nh đ&atilde; viết tr&ecirc;n đ&acirc;y kh&ocirc;ng d&ugrave;ng được.</p>
<p>The Big Fail!!!</p>
            ]]>
        </content>
    </entry>
    <entry>
        <title>làm mới hoặc bọc lại ghế</title>
        <author>
            <name>selene</name>
        </author>
        <link href="https://selenevn.github.io/lam-moi-hoac-boc-lai-ghe.html"/>
        <id>https://selenevn.github.io/lam-moi-hoac-boc-lai-ghe.html</id>
            <category term="chair"/>

        <updated>2017-08-23T10:34:08+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="https://selenevn.github.io/media/posts/4/tree-trunk-stump-side-table-a-brown-leather-corner-table-with-mini-pillow-a-standing-lamp-behind-the-chair-two-decorative-plants.jpg" alt="" />
                Xem tr&ecirc;n mạng thấy mảng n&agrave;y cũng c&oacute; thể l&agrave;m được. Xem videoclip v&agrave; h&igrave;nh ảnh tr&ecirc;n mạng th&igrave; thấy mọi thứ c&oacute; vẻ dễ d&agrave;ng. Tất nhi&ecirc;n n&oacute; cũng như tất cả những thứ l&agrave;m thủ c&ocirc;ng kh&aacute;c. Để l&agrave;m được đẹp th&igrave; cần thử nghiệm v&agrave; luyện tập nhiều.
            ]]>
        </content>
    </entry>
    <entry>
        <title>những thứ khác</title>
        <author>
            <name>selene</name>
        </author>
        <link href="https://selenevn.github.io/nhung-thu-khac.html"/>
        <id>https://selenevn.github.io/nhung-thu-khac.html</id>
            <category term="craft"/>

        <updated>2017-08-23T15:05:12+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="https://selenevn.github.io/media/posts/3/a73ddb2267736762c54fb18d49413ae7.jpg" alt="" />
                Trước giờ lang thang tr&ecirc;n mạng xem thấy rất nhiều đồ thủ c&ocirc;ng hay, c&aacute;i đ&eacute;o g&igrave; cũng muốn l&agrave;m. Th&iacute;ch th&igrave; th&iacute;ch vậy th&ocirc;i, nhưng giờ bảo l&agrave;m đi chắc cũng chả l&agrave;m được. Thứ nhất l&agrave; kh&ocirc;ng c&oacute; đồ, thứ hai l&agrave; l&agrave;m rồi b&aacute;n cho ai. Động đến c&aacute;i g&igrave; cũng phải chi tiền, m&agrave; tiền th&igrave; kh&ocirc;ng kiếm ra. Đến tiền học của trẻ con cũng nhay nh&aacute; m&atilde;i kh&ocirc;ng đ&oacute;ng được cho n&oacute;.
            ]]>
        </content>
    </entry>
    <entry>
        <title>Trang web?</title>
        <author>
            <name>selene</name>
        </author>
        <link href="https://selenevn.github.io/trang-web.html"/>
        <id>https://selenevn.github.io/trang-web.html</id>
            <category term="web"/>
            <category term="idea"/>

        <updated>2017-08-23T15:05:35+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="https://selenevn.github.io/media/posts/2/010f8ef9764e574f0080e0699c121c59.jpg" alt="" />
                <p>L&agrave;m đ&eacute;o g&igrave; cũng nghĩ tới việc lập trang web để giới thiệu v&agrave; b&aacute;n h&agrave;ng. C&oacute; cần thiết kh&ocirc;ng nhỉ? Đồ th&igrave; l&agrave; l&agrave;m ra chứ kh&ocirc;ng phải sang quảng ch&acirc;u nhặt về, thế n&ecirc;n chả c&oacute; g&igrave; gọi l&agrave; đa dạng. Post được v&agrave;i c&aacute;i l&ecirc;n facebook hết mẹ vốn.</p>
<p>Tao th&iacute;ch c&aacute;i trang giống như thế n&agrave;y:&nbsp;<a href="https://frankcleggleatherworks.com/">https://frankcleggleatherworks.com/</a>. Kh&ocirc;ng biết bao giờ mới l&agrave;m ra được đủ để đưa l&ecirc;n giống như thế nhỉ? Hay l&agrave; cứ ăn cắp con mẹ n&oacute; mấy c&aacute;i mẫu t&uacute;i đưa bừa l&ecirc;n, rồi thằng n&agrave;o đặt h&agrave;ng th&igrave; l&agrave;m? Thế cũng nguy hiểm, v&igrave; thứ nhất l&agrave; kh&ocirc;ng biết b&ecirc;n trong n&oacute; l&agrave;m thế n&agrave;o, thứ hai l&agrave; c&aacute;i da để l&agrave;m kh&ocirc;ng phải l&uacute;c n&agrave;o cũng c&oacute;, quan trọng hơn l&agrave; dễ d&iacute;nh vấn đề bản quyền, m&agrave; tao th&igrave; lại kh&ocirc;ng muốn thế.</p>
            ]]>
        </content>
    </entry>
    <entry>
        <title>Hello world!</title>
        <author>
            <name>selene</name>
        </author>
        <link href="https://selenevn.github.io/hello-world.html"/>
        <id>https://selenevn.github.io/hello-world.html</id>

        <updated>2017-08-23T15:05:42+07:00</updated>
            <summary></summary>
        <content type="html">
            <![CDATA[
                    <img src="https://selenevn.github.io/media/posts/1/22560257.jpg" alt="" />
                <p>L&acirc;u lắm rồi mới lại ngồi tự kỉ...</p>
<p>Thời gian vừa rồi đầu tư kh&aacute; nhiều thời gian cho việc học th&ecirc;m một kỹ năng mới: l&agrave;m đồ da thủ c&ocirc;ng. N&oacute;i chung kh&ocirc;ng qu&aacute; kh&oacute; để l&agrave;m ra sản phẩm. Nhưng... như mọi nghề thủ c&ocirc;ng kh&aacute;c, để l&agrave;m ra được sản phẩm đẹp đ&ograve;i hỏi rất nhiều thứ kh&aacute;c ngo&agrave;i kỹ năng, đặc biệt l&agrave; sự ki&ecirc;n tr&igrave;. Sản phẩm kiểu n&agrave;y nhiều người th&iacute;ch, nhưng &iacute;t người mua. Để đạt được tr&igrave;nh độ "c&oacute; người mua" nghĩa l&agrave; sản phẩm l&agrave;m ra phải đẹp v&agrave; tinh xảo lắm.</p>
<p><img src="https://selenevn.github.io/media/posts/1/6761de4b84a52bb373eda5d26aefdf32.jpg" alt="" width="500" height="500"></p>
            ]]>
        </content>
    </entry>
</feed>
